Revit 2027 API
RebarTrimExtendData.GetAddedBarGeometry Method
 Gets the added curves that will represent the bar at index barIndex.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Curve> GetAddedBarGeometry(
	int barIndex
)
Public Function GetAddedBarGeometry (
	barIndex As Integer
) As IList(Of Curve)
public:
IList<Curve^>^ GetAddedBarGeometry(
	int barIndex
)
member GetAddedBarGeometry :
        barIndex : int -> IList<Curve>
Parameters
barIndex Int32
 The index of the bar. Should be a number between 0 and GetNumberOfBarGeometry() - 1.
Return Value
IList<Curve>
 Returns the curves that will represent the bar at index barIndex. The terminations' plane normals will be applied on these curves.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  barIndex is not in the range [ 0, GetNumberOfBarGeometry()-1 ].
See Also
Reference
RebarTrimExtendData Class
Autodesk.Revit.DB.Structure Namespace